app/Actions/CKGSis/Safe/AgencySafe/GetCollectionsAction.php

    public function handle($request)
    {
        $firstDate = new Carbon($request->firstDate);
        $lastDate = new Carbon($request->lastDate);
//        $dateFilter = $request->dateFilter;
        $dateFilter = 'true';

        $cargoes = DB::table('cargoes')
            ->join('users', 'users.id', '=', 'cargoes.creator_user_id')
            ->join('agencies', 'agencies.id', '=', 'users.agency_code')
            ->join('currents', 'currents.id', '=', 'cargoes.sender_id')
            ->join('cargo_collections', 'cargo_collections.cargo_id', '=', 'cargoes.id')
            ->select(['cargoes.*', 'agencies.city as city_name', 'collection_type_entered', 'currents.current_code as sender_current_code', 'agencies.district as district_name', 'agencies.agency_name', 'users.name_surname as user_name_surname'])
            ->whereRaw($dateFilter == 'true' ? "cargoes.created_at between '" . $firstDate . "'  and '" . $lastDate . "'" : ' 1 > 0')
            ->whereRaw('cargoes.deleted_at is null')
            ->where('cargoes.departure_agency_code', Auth::user()->agency_code)
            ->orderByDesc('created_at')
            ->get();
---
select `cargoes`.*, `agencies`.`city` as `city_name`, `cargo_collections`.`collection_type_entered`, `cargo_collections`.`description` as `collection_description`, `currents`.`current_code` as `sender_current_code`, `agencies`.`district` as `district_name`, `agencies`.`agency_name`, `users`.`name_surname` as `user_name_surname` from `cargoes` inner join `users` on `users`.`id` = `cargoes`.`creator_user_id` inner join `agencies` on `agencies`.`id` = `users`.`agency_code` inner join `currents` on `currents`.`id` = `cargoes`.`sender_id` inner join `cargo_collections` on `cargo_collections`.`cargo_id` = `cargoes`.`id` where cargoes.created_at between '2022-02-24 00:00:00'  and '2022-02-24 23:59:59' and cargoes.deleted_at is null and `cargoes`.`departure_agency_code` = 1