app/Http/Controllers/Backend/Safe/AgencySafeController.php

    function getDailySafeReport()
    {

        $data['agency_payments'] = DB::table('agency_payments')
            ->where('agency_id', Auth::user()->agency_code)
            ->sum('payment');

        $data['devreden_kasa'] = DB::table('cargoes')
            ->join('cargo_collections', 'cargo_collections.cargo_id', '=', 'cargoes.id')
            ->whereRaw('deleted_at is null')
            ->where('departure_agency_code', '=', Auth::user()->agency_code)
            ->where('cargoes.created_at', '<', Carbon::now()->format('Y-m-d') . ' 00:00:00')
            ->where('collection_type_entered', 'NAKİT')
            ->sum('total_price');

        $data['devreden_kasa'] -= $data['agency_payments'];


        $data['gun_ici'] = DB::table('cargoes')
            ->join('cargo_collections', 'cargo_collections.cargo_id', '=', 'cargoes.id')
            ->whereRaw('deleted_at is null')
            ->where('departure_agency_code', '=', Auth::user()->agency_code)
            ->where('cargoes.created_at', '>', Carbon::now()->format('Y-m-d') . ' 00:00:00')
            ->where('payment_type', '=', 'Gönderici Ödemeli')
            ->where('collection_type_entered', 'NAKİT')
            ->sum('total_price');
---
select sum(`payment`) as aggregate from `agency_payments` where `agency_id` = 1
select sum(`total_price`) as aggregate from `cargoes` inner join `cargo_collections` on `cargo_collections`.`cargo_id` = `cargoes`.`id` where deleted_at is null and `departure_agency_code` = 1 and `cargoes`.`created_at` < '2022-02-24 00:00:00' and `collection_type_entered` = 'NAKİT'
select sum(`total_price`) as aggregate from `cargoes` inner join `cargo_collections` on `cargo_collections`.`cargo_id` = `cargoes`.`id` where deleted_at is null and `departure_agency_code` = 1 and `cargoes`.`created_at` > '2022-02-24 00:00:00' and `payment_type` = 'Gönderici Ödemeli' and `collection_type_entered` = 'NAKİT'