app/GeneralHelpers.php

select count(*) as aggregate from `view_module_sub_module_url` where (`module_id` = 1 and `url_name` = 'MainCargo')
---
function set_module_active($module_id, $url, $className = 'active')
{
    $is_there = DB::table('view_module_sub_module_url')
        ->where([
            'module_id' => $module_id,
            'url_name' => $url
        ])
        ->count();

select `description`, `created_at` from `view_user_log_detail` where `causer_id` = 93 and `log_name` in ('General Motion', 'Password Reset', 'Ticket Reply', 'Login', 'Cari Onayı') order by `id` desc limit 10
---
function getLast10PersonelLog()
{
    $logs = DB::table('view_user_log_detail')
        ->select(['description', 'created_at'])
        ->where('causer_id', Auth::id())
        ->whereIn('log_name', UsersLogNames())
        ->limit(10)
        ->orderBy('id', 'desc')
        ->get();

select * from `view_user_role` where `id` = 93 limit 1
---
function getUserFirstPage()
{
    $user_id = Auth::user()->id;
    $role = DB::table('view_user_role')->where('id', $user_id)->first();

select * from `system_updates` order by `id` desc limit 1
---
function getSystemVersion()
{
    $latestVersion = \App\Models\SystemUpdate::orderBy('id', 'desc')->first();