app/ModuleHelpers.php

function GetTitles()
{
    $module = DB::table('view_get_titles_modules')
        ->where('role_id', Auth::user()->role_id)
        ->orderBy('must')
        ->get();
---
select * from `view_get_titles_modules` where `role_id` = 1 order by `must` asc

function GetModuleNames($title)
{
    $module_names = DB::table('view_get_module_name')
        ->where('role_id', Auth::user()->role_id)
        ->where('title', $title)
        ->orderBy('must')
        ->get();
---
select * from `view_get_module_name` where `role_id` = 1 and `title` = 'GENEL MENÜ' order by `must` asc

function GetModulesAllInfo($module_name)
{
    $sub_module_names = DB::table('view_get_modules_all_info')
        ->where('role_id', Auth::user()->role_id)
        ->where('module_name', "$module_name")
        ->orderBy('sub_module_must')
        ->get();
---
select * from `view_get_modules_all_info` where `role_id` = 1 and `module_name` = 'Kargolar' order by `sub_module_must` asc

function GetLayoutInformaiton()
{
    $user['role'] = DB::table('users')
        ->join('roles', 'users.role_id', '=', 'roles.id')
        ->where('users.id', Auth::user()->id)
        ->first();
---
select * from `users` inner join `roles` on `users`.`role_id` = `roles`.`id` where `users`.`id` = 93 limit 1

function getSystemTheme()
{
    return $theme = \App\Models\ThemeSystem::find(1);
---
select * from `theme_system` where `theme_system`.`id` = 1 limit 1