app/Http/Controllers/Backend/Personel/PersonelController.php

    public function searchModule(Request $request)
    {
        $search = $request->searchTerm;

        $permissions = DB::table('role_permissions')
            ->orderBy('module_group_must')
            ->orderBy('module_must')
            ->whereRaw(" role_id = " . Auth::user()->role_id . " and (sub_name like '%" . $search . "%' or module_name like '%" . $search . "%')")
            ->limit(10)
            ->get();
---
select * from `role_permissions` where  role_id = 1 and (sub_name like '%%' or module_name like '%%') order by `module_group_must` asc, `module_must` asc limit 10