app/Actions/CKGSis/MainCargo/GetMainCargoesAction.php

    public function handle($request)
    {
        $agency = Agencies::where('id', Auth::user()->agency_code)->first();
---
select * from `agencies` where `id` = 1 and `agencies`.`deleted_at` is null limit 1