app/Http/Controllers/AgencyTransferCarsController.php

    public function store(AgencyTransferCarRequest $request)
    {
        $user = Auth::user();
        $validated = $request->validated();
        $validated['branch_code'] = $user->getAgency->id;
        $validated['confirm'] = '0';
        $validated['creator_id'] = $user->id;

        $create = TcCars::create($validated);
---
insert into `tc_cars` (`plaka`, `marka`, `model`, `model_yili`, `car_type`, `branch_code`, `sofor_ad`, `sofor_telefon`, `sofor_adres`, `confirm`, `creator_id`, `updated_at`, `created_at`) values ('12345', 'Tesla', 'XXX', '2010', 'Acente', 1, 'sadas', '(543) 235 66 23', 'asdasdasdas', '0', 93, '2022-02-23 16:08:45', '2022-02-23 16:08:45')

    public function getAgencyTransferCar(Request $request)
    {
        $car = TcCars::with('branch', 'creator.getAgency', 'cikishAktarma', 'varishAktarma', 'confirmer')->where('id', $request->carID)
            ->first();
---
select * from `agencies` where `agencies`.`id` in (1) and `agencies`.`deleted_at` is null
select * from `tc_cars` where `id` = '26' and `tc_cars`.`deleted_at` is null limit 1