app/Http/Controllers/AgencyTransferCarsController.php

select * from `variouses`
select * from `cities`
select * from `transshipment_centers` where `transshipment_centers`.`deleted_at` is null
---
    public function index()
    {
        $data['agencies'] = Various::all();
        $data['cities'] = Cities::all();
        $data['transshipment_centers'] = TransshipmentCenters::all();

select * from `transshipment_centers` where `transshipment_centers`.`deleted_at` is null
select * from `cities`
---
    public function create()
    {
        $user = Auth::user();
        $data['transshipment_centers'] = TransshipmentCenters::all();
        $data['cities'] = Cities::all();

select * from `tc_cars` where `car_type` = 'Acente' and `tc_cars`.`deleted_at` is null
---
    public function allData(Request $request)
    {
        $marka = $request->marka;
        $model = $request->model;
        $plaka = $request->plaka;
        $hat = $request->hat;
        $aracKapasitesi = $request->aracKapasitesi;
        $cikisAktarma = $request->cikisAktarma;
        $varisAktarma = $request->varisAktarma;
        $soforIletisim = $request->soforIletisim;

        $cars = TcCars::with('creator', 'cikishAktarma', 'varishAktarma')
            ->where('car_type', 'Acente')
            ->when($marka, function($q) use($marka){ return $q->where('marka', 'like', '%'.$marka.'%');})
            ->when($model, function($q) use($model){ return $q->where('model', 'like', '%'.$model.'%');})
            ->when($plaka, function($q) use($plaka){ return $q->where('plaka', 'like', '%'.$plaka.'%');})
            ->when($hat, function($q) use($hat){ return $q->where('hat', 'like', '%'.$hat.'%');})
            ->when($aracKapasitesi, function($q) use($aracKapasitesi){ return $q->where('arac_kapasitesi', 'like', '%'.$aracKapasitesi.'%');})
            ->when($soforIletisim, function($q) use($soforIletisim){ return $q->where('sofor_telefon', 'like', '%'.$soforIletisim.'%');})
            ->when($soforIletisim, function($q) use($soforIletisim){ return $q->where('arac_sahibi_yakini_telefon', 'like', '%'.$soforIletisim.'%');})
            ->when($varisAktarma, function($q) use($varisAktarma){ return $q->where('varis_aktarma', 'like', $varisAktarma);})
            ->when($cikisAktarma, function($q) use($cikisAktarma){ return $q->where('cikis_aktarma', 'like', $cikisAktarma);})
            ->get();

        $cars->each(function($key){
            $key['cikishAktarma'] = $key->cikishAktarma->tc_name ?? null;
            $key['varishAktarma'] = $key->varishAktarma->tc_name ?? null;
            $muayene_date_diff = Carbon::now()->diffInDays($key->muayene_bitis_tarihi);
            $key['muayene_kalan_sure'] = Carbon::now() < Carbon::parse($key->muayene_bitis_tarihi) ? $muayene_date_diff : - $muayene_date_diff;
            $sigorta_date_diff = Carbon::now()->diffInDays($key->trafik_sigortasi_bitis_tarihi);
            $key['sigorta_kalan_sure'] = Carbon::now() < Carbon::parse($key->muayene_bitis_tarihi) ? $sigorta_date_diff : - $sigorta_date_diff;
        });

insert into `tc_cars` (`plaka`, `marka`, `model`, `model_yili`, `branch_code`, `sofor_ad`, `sofor_telefon`, `sofor_adres`, `confirm`, `car_type`, `updated_at`, `created_at`) values ('12345', 'asda', 'asdas', 'Auth', 1, 'sdfasdf', '(543) ___ __ __', 'dsfsadfasdfa', 0, 'Acente', '2022-02-23 15:00:32', '2022-02-23 15:00:32')
---
    public function store(AgencyTransferCarRequest $request)
    {
        $user = Auth::user();
        $validated = $request->validated();
        $validated['branch_code'] = $user->getAgency->id;
        $validated['confirm'] = '0';
        $validated['creator_id'] = $user->id;

        $create = TcCars::create($validated);