app/Http/Controllers/TransferCarsController.php

select * from `variouses`
select * from `cities`
select * from `transshipment_centers` where `transshipment_centers`.`deleted_at` is null
---
    public function index()
    {
        $data['agencies'] = Various::all();
        $data['cities'] = Cities::all();
        $data['transshipment_centers'] = TransshipmentCenters::all();

select * from `transshipment_centers` where `transshipment_centers`.`deleted_at` is null
---
    public function create()
    {
        $data['transshipment_centers'] = TransshipmentCenters::all();

select * from `tc_cars` where `tc_cars`.`deleted_at` is null
---
    public function allData(Request $request)
    {
        $marka = $request->marka;
        $model = $request->model;
        $plaka = $request->plaka;
        $hat = $request->hat;
        $aracKapasitesi = $request->aracKapasitesi;
        $cikisAktarma = $request->cikisAktarma;
        $varisAktarma = $request->varisAktarma;
        $soforIletisim = $request->soforIletisim;

        $cars = TcCars::with('creator', 'cikishAktarma', 'varishAktarma')
            ->when($marka, function($q) use($marka){ return $q->where('marka', 'like', '%'.$marka.'%');})
            ->when($model, function($q) use($model){ return $q->where('model', 'like', '%'.$model.'%');})
            ->when($plaka, function($q) use($plaka){ return $q->where('plaka', 'like', '%'.$plaka.'%');})
            ->when($hat, function($q) use($hat){ return $q->where('hat', 'like', '%'.$hat.'%');})
            ->when($aracKapasitesi, function($q) use($aracKapasitesi){ return $q->where('arac_kapasitesi', 'like', '%'.$aracKapasitesi.'%');})
            ->when($soforIletisim, function($q) use($soforIletisim){ return $q->where('sofor_telefon', 'like', '%'.$soforIletisim.'%');})
            ->when($soforIletisim, function($q) use($soforIletisim){ return $q->where('arac_sahibi_yakini_telefon', 'like', '%'.$soforIletisim.'%');})
            ->when($varisAktarma, function($q) use($varisAktarma){ return $q->where('varis_aktarma', 'like', $varisAktarma);})
            ->when($cikisAktarma, function($q) use($cikisAktarma){ return $q->where('cikis_aktarma', 'like', $cikisAktarma);})
            ->get();

select * from `tc_cars` where `id` = '25' and `tc_cars`.`deleted_at` is null limit 1
select * from `transshipment_centers` where `id` = '' and deleted_at is null limit 1
---
    public function getTransferCar(Request $request)
    {
        $cars = TcCars::with('cikishAktarma')->where('id', $request->carID)
            ->first();

        $value = $cars->ugradigi_aktarmalar;
        $value = substr($value, 0, strlen($value) - 1);
        $array = explode(',', $value);

        $aktarmalar = "";

        foreach ($array as $key) {
            $exist = DB::table('transshipment_centers')
                ->where('id', $key)
                ->whereRaw('deleted_at is null')
                ->first();