app/Http/Controllers/Backend/MainCargo/MainCargoController.php

    public function index()
    {
        $data['agencies'] = Agencies::all();
        $data['gm_users'] = DB::table('users')
            ->where('agency_code', 1)
            ->get();

        ## get agency district
        $agency = Agencies::where('id', Auth::user()->agency_code)->first();
        $data['districts'] = DB::table('view_city_districts')
            ->where('city_name', $agency->city)
            ->get();

        $data['user_district'] = $agency->district;
        $data['user_city'] = $agency->city;
        $data['status'] = $status = DB::table('cargoes')
            ->select('status')->groupBy('status')->get();
        $data['status_for_human'] = $status = DB::table('cargoes')
            ->select('status_for_human')->groupBy('status_for_human')->get();
        $data['transporters'] = $status = DB::table('cargoes')
            ->select('transporter')->groupBy('transporter')->get();
        $data['systems'] = $status = DB::table('cargoes')
            ->select('system')->groupBy('system')->get();
        $data['cargo_contents'] = $status = DB::table('cargoes')
            ->select('cargo_content')->groupBy('cargo_content')->get();
        $data['cargo_types'] = $status = DB::table('cargoes')
            ->select('cargo_type')->groupBy('cargo_type')->get();
        $data['agency_users'] = User::where('agency_code', Auth::user()->agency_code)->get();
        $data['cities'] = Cities::all();
---
select * from `agencies` where `agencies`.`deleted_at` is null
select * from `agencies` where `id` = 1 and `agencies`.`deleted_at` is null limit 1
select * from `view_city_districts` where `city_name` = 'İSTANBUL'
select `status` from `cargoes` group by `status`
select * from `users` where `agency_code` = 1 and `users`.`deleted_at` is null
select * from `cities`

            ->where('departure_agency_code', $agency->id)
            ->count();

        $daily['file_count'] = DB::table('cargoes')
            ->whereRaw("created_at BETWEEN '" . date('Y-m-d') . " 00:00:00' and '" . date('Y-m-d') . " 23:59:59'")
            ->whereRaw('deleted_at is null')
            ->where('cargo_type', 'Dosya-Mi')
            ->where('departure_agency_code', $agency->id)
            ->count();
---
select count(*) as aggregate from `cargoes` where created_at BETWEEN '2022-02-24 00:00:00' and '2022-02-24 23:59:59' and deleted_at is null and `cargo_type` <> 'Dosya-Mi' and `departure_agency_code` = 1

            ->where('departure_agency_code', $agency->id)
            ->sum('desi');

        $daily['total_number_of_pieces'] = DB::table('cargoes')
            ->whereRaw("created_at BETWEEN '" . date('Y-m-d') . " 00:00:00' and '" . date('Y-m-d') . " 23:59:59'")
            ->whereRaw('deleted_at is null')
            ->where('departure_agency_code', $agency->id)
            ->whereNotIn('cargo_type', ['Dosya', 'Mi'])
            ->sum('number_of_pieces');

        $daily['total_endorsement'] = DB::table('cargoes')
            ->whereRaw("created_at BETWEEN '" . date('Y-m-d') . " 00:00:00' and '" . date('Y-m-d') . " 23:59:59'")
            ->whereRaw('deleted_at is null')
            ->where('departure_agency_code', $agency->id)
            ->sum('total_price');
---
select count(*) as aggregate from `cargoes` where created_at BETWEEN '2022-02-24 00:00:00' and '2022-02-24 23:59:59' and deleted_at is null and `departure_agency_code` = 1
select sum(`total_price`) as aggregate from `cargoes` where created_at BETWEEN '2022-02-24 00:00:00' and '2022-02-24 23:59:59' and deleted_at is null and `departure_agency_code` = 1