app/Http/Controllers/Backend/DefaultController.php


            }

            $user = User::find(Auth::id());
---
select * from `users` where `users`.`id` = 93 and `users`.`deleted_at` is null limit 1